```
    @Author: Nishanth
    @Date: 07-04-2022 12:29:00
    @Last Modified by: Nishanth
    @Last Modified Date: 07-04-2022 18:54:00
    @Title: A list of practice pandas programs
```

**Import required libraries**

In [24]:
import pandas as pd
import numpy as np

1. **Write a Python program to create and display a one-dimensional array-like object
containing an array of data using Pandas module**

In [5]:
# Create an array like object using pandas module
pd_series = pd.Series([12, 34, 56, 78])

print(f"Pandas Series:\n{pd_series}")

Pandas Series:
0    12
1    34
2    56
3    78
dtype: int64

2. **Write a Python program to convert a Panda module Series to Python list and it's type.**

In [6]:
def series_to_list(pd_series: pd.Series):
    """
        Description:
            Converts pandas series to list
        
        Paramter:
            pd_series: a pandas series
        
        Return:
            None
    """
    list_from_series = pd_series.to_list()
    print(f"Pandas Series:\n{pd_series}")
    print(f"Converted list:\n{list_from_series}")

In [7]:
# Using series_to_list() convert a pd.Series to a list
pd_series = pd.Series([12, 34, 56, 78])
series_to_list(pd_series)

Pandas Series:
0    12
1    34
2    56
3    78
dtype: int64
Converted list:
[12, 34, 56, 78]

3. **Write a Python program to add, subtract, multiple and divide two Pandas Series**

    Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [18]:
def series_math_op(series1: pd.Series, series2: pd.Series):
    """
        Description:
            Various math operations done on the 2 series
        
        Paramter:
            series1, series2: 2 pandas series
        
        Return:
            None
    """
    print(f"series1: {series1.values}\nseries2: {series2.values}")
    print(f"series1 + series2: {(series1 + series2).values}")
    print(f"series1 - series2: {(series1 - series2).values}")
    print(f"series1 * series2: {(series1 * series2).values}")
    print(f"series1 / series2: {(series1 / series2).values}")

In [19]:
# Using series_math_op() compute math operations on 2 series data
ser1 = pd.Series([2, 4, 6, 8, 10])
ser2 = pd.Series([1, 3, 5, 7, 9])
series_math_op(ser1, ser2)

series1: [ 2  4  6  8 10]
series2: [1 3 5 7 9]
series1 + series2: [ 3  7 11 15 19]
series1 - series2: [1 1 1 1 1]
series1 * series2: [ 2 12 30 56 90]
series1 / series2: [2.         1.33333333 1.2        1.14285714 1.11111111]

4. **Write a Python program to get the powers of an array values element-wise**

    Note: First array elements raised to powers from second array\
    Expected Output:\
    Original array\
    [0 1 2 3 4 5 6]\
    First array elements raised to powers from second array, element-wise:\
    [ 0 1 8 27 64 125 216]

In [22]:
def series_power_raise(series: pd.Series):
    """
        Description:
            Raises series values to powers of itself 
        
        Paramter:
            series: a pandas series
        
        Return:
            None
    """
    power_raised_series = series ** series
    print(f"Series: {series.values}")
    print(f"Power raised: {power_raised_series.values}")

In [23]:
# Using the above method compute the series raised to the power of itself
sample_series = pd.Series([0,1,2,3,4,5,6])
series_power_raise(sample_series)

Series: [0 1 2 3 4 5 6]
Power raised: [    1     1     4    27   256  3125 46656]

5. **Write a Python program to create and display a DataFrame from a specified dictionary data which has the index labels**

    Sample Python dictionary data and list labels:\
    exam_data = {\
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],\
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']\
        }\
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [29]:
# create a pandas dataframe using the given dictionary and index labels list
exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
        }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

exam_df = pd.DataFrame(exam_data, labels)
print(f"Data Frame created:\n")
exam_df

Data Frame created:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

6. **Write a Python program to display a summary of the basic information about a specified Data Frame and its data**

    Sample Python dictionary data and list labels:\
    exam_data = {\
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],\
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']\
    }\
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [30]:
# Display the exam_df info
print(f"Exam Data frame info:")
exam_df.info()

Exam Data frame info:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

7. **Write a Python program to get the first 3 rows of a given DataFrame**

    Sample Python dictionary data and list labels:\
    exam_data = {\
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],\
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']\
    }\
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [31]:
# Display first 3 rows of the exam data frame
exam_df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

8. **Write a Python program to select the 'name' and 'score' columns from the following DataFrame**

    Sample Python dictionary data and list labels:\
    exam_data = {\
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],\
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']\
    }\
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [34]:
# display the name and score columns of the exam_df
exam_df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

9. **Write a Python program to select the specified columns and rows from a given data frame.**

    **Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame**

    Sample Python dictionary data and list labels:\
    exam_data = {\
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],\
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']\
    }\
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [36]:
# print rows 1,3,5,6 of the exam_df and columns 'name' and 'score'
exam_df[['name', 'score']].iloc[[1,3,5,6]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

10. **Write a Python program to select the rows where the number of attempts in the examination is greater than 2**

    Sample Python dictionary data and list labels:\
    exam_data = {\
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],\
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']\
    }\
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [41]:
# Print exam_df rows where attempts > 2
attempts_gt_2 = exam_df.where(exam_df['attempts'] > 2)
attempts_gt_2.dropna(axis=0, how='all', inplace=True)
attempts_gt_2

      name  score  attempts qualify
b     Dima    9.0       3.0      no
d    James    NaN       3.0      no
f  Michael   20.0       3.0     yes

11. **Write a Python program to count the number of rows and columns of a DataFrame**

    Sample Python dictionary data and list labels:\
    exam_data = {\
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],\
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']\
    }\
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [42]:
# Display the no of rows and columns of a dataframe
rows, cols = exam_df.shape
print(f"Data frame shape: {exam_df.shape}")
print(f"Rows: {rows}")
print(f"Columns: {cols}")

Data frame shape: (10, 4)
Rows: 10
Columns: 4

12. **Write a Python program to select the rows where the score is missing, i.e. is NaN**

    Sample Python dictionary data and list labels:\
    exam_data = {\
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],\
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']\
    }\
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [47]:
# Print exam_df rows where score is nan
score_nan = exam_df.where(exam_df['score'].isna())
score_nan.dropna(axis=0, how='all', inplace=True)
score_nan

    name  score  attempts qualify
d  James    NaN       3.0      no
h  Laura    NaN       1.0      no

13. **Write a Python program to select the rows where number of attempts in the examination is less than 2 and score greater than 15**

In [52]:
# Print exam_df rows where attempts<2 and score>15
attempts_lt2_score_gt15 = exam_df.where((exam_df['score'] > 15) & (exam_df['attempts'] < 2))
attempts_lt2_score_gt15.dropna(axis=0, how='all', inplace=True)
attempts_lt2_score_gt15

    name  score  attempts qualify
j  Jonas   19.0       1.0     yes

14. **Write a Python program to change the score in row 'd' to 11.5**

    Sample Python dictionary data and list labels:\
    exam_data = {\
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],\
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']\
    }\
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [55]:
# Using loc change score of row 'd'
exam_df.loc['d', 'score'] = 11.5
exam_df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes